app/views/professors/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE (comment LIKE '%["travis"]%') AND "reviews"."professor_id" = ?  [["professor_id", 2]]
SELECT COUNT({:recommend=>false}) FROM "reviews" WHERE "reviews"."professor_id" = ?  [["professor_id", 2]]
---
        <li><strong>Escola: </strong><%= @professor.school %></li>
        <li><strong><%= "Review".pluralize(@review.length) %>: