app/controllers/admins_controller.rb

  def show
       @user = User.find(params[:id])
       @professor = Professor.where("flag > ?", 0).order("flag DESC")
       @review = Review.includes(:professor).where("flag > ?", 0).order("flag DESC")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "professors".* FROM "professors" WHERE "professors"."id" IN (SELECT "reviews"."id" FROM "reviews" WHERE (flag > 0) ORDER BY flag DESC) ORDER BY "professors"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "professors".* FROM "professors" WHERE "professors"."id" IN (1, 2)
SELECT "reviews".* FROM "reviews" WHERE (flag > 0) ORDER BY flag DESC