app/controllers/professors_controller.rb

SELECT  "professors".* FROM "professors" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
     @professors = Professor.paginate(:page => params[:page], per_page: 20).order(sort_column + " " + sort_direction)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."professor_id" = ? ORDER BY created_at DESC  [["professor_id", 15]]
SELECT  1 AS one FROM "reviews" WHERE (fullname LIKE '%["travis"]%') AND "reviews"."professor_id" = ? LIMIT ?  [["professor_id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE (comment LIKE '%["travis"]%') AND "reviews"."professor_id" = ?  [["professor_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."professor_id" = ?  [["professor_id", 15]]
---
  def show
      @review = Review.where(professor_id: @professor.id).order("created_at DESC")
      #@user = User.where(user_id: @review.user_id)   <===== uncomment when showing users.
    if @review.exists?
      @avg_review = @review.average(:rating).round(1)

SELECT "professors".* FROM "professors"
---
  def search
    if params[:search].present?
        @professors = Professor.search(params[:search])

INSERT INTO "professors" ("fullname", "school", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["fullname", "Jim Kirk"], ["school", "FGV"], ["created_at", "2017-05-18 17:30:27.991325"], ["updated_at", "2017-05-18 17:30:27.991325"]]
---
  def create
    @schooldef = ['FGV', 'other']
    @professor = Professor.new(professor_params)
    respond_to do |format|
      if verify_recaptcha(model: @professor) && @professor.save

UPDATE "professors" SET "fullname" = ?, "school" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["fullname", "Travis Fantina"], ["school", "FGV"], ["updated_at", "2017-07-12 15:06:54.364306"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)

DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 4]]
---
  def destroy
    @professor.destroy

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "professors" SET "flag" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["flag", 1], ["updated_at", "2016-11-09 15:46:43.876162"], ["id", 980190962]]
---
  def flag
    @professor = Professor.find(params[:id])
    @professor.increment!(:flag)

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])