app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "ease", "interesting", "helpfull", "comment", "created_at", "updated_at", "professor_id", "whatclass", "recommend", "major", "teachwell", "grade") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  #if user_signed_in?
  #  @review = current_user.reviews.create(review_params)
  #    @review.professor_id = @professor.id
  #    @review.save
  #    redirect_to @professor
  #  else
      @review = Review.new(review_params)
      @review.professor_id = @professor.id
      #@review.guest = :guest
      #@review.rating = (:ease + :interest + :helpful)/3
      respond_to do |format|
      if verify_recaptcha(model: @review) && @review.save

UPDATE "reviews" SET "ease" = ?, "helpfull" = ?, "interesting" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["ease", 5], ["helpfull", 4], ["interesting", 4], ["comment", "Great professor the very best! Ok"], ["updated_at", "2017-05-18 17:56:39.185379"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "flag" = COALESCE("flag", 0) + 1 WHERE "reviews"."id" = ?  [["id", 3]]
---
  def flag
      @review = Review.find(params[:id])
      @review.increment!(:flag)

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:professor_id])