app/controllers/site_controller.rb

SELECT COUNT("professors"."id") FROM "professors"
SELECT  "professors".* FROM "professors" ORDER BY "professors"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 9]]
---
   def index
     #@num = Professor.try.count('id')
     offset = rand(Professor.count)
     @rand = Professor.offset(offset).first