app/controllers/users_controller.rb

  def search
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (email LIKE '%tfantina%') ORDER BY created_at DESC

  def admin
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def toggle_admin
    @user = User.find_by_id(params[:id])
    @user.admin = true
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2017-07-01 23:46:13.425100"], ["id", 2]]